// const category_haishen = {
//   id: '1001',
//   title: '海参',
//   saasId: '666666',
// };
// const spec_haishen = [
//   // 以下是海参的分类
//   // 海参 》分类
//   {
//     saasId: '666666',
//     cId: '1001',
//     sId: null, // root spec
//     id: '2000',
//     title: '分类',
//   },
//   {
//     saasId: '666666',
//     cId: '1001',
//     sId: '2000',
//     id: '2001',
//     title: '干海参',
//   },
//   {
//     saasId: '666666',
//     cId: '1001',
//     sId: '2000',
//     id: '2002',
//     title: '生鲜海参',
//   },
//   {
//     saasId: '666666',
//     cId: '1001',
//     sId: '2000',
//     id: '2003',
//     title: '即食海参',
//   },
//   // 海参 》科属
//   {
//     saasId: '666666',
//     cId: '1001',
//     sId: null, // root spec
//     id: '3000',
//     title: '科属',
//   },
//   {
//     saasId: '666666',
//     cId: '1001',
//     sId: '3000',
//     id: '3001',
//     value: '刺参科',
//     image: '',
//   },
//   {
//     saasId: '666666',
//     cId: '1001',
//     sId: '3000',
//     id: '3002',
//     value: '光参科',
//     image: '',
//   },
//   // 海参 》科属 > 刺参科
//   {
//     saasId: '666666',
//     cId: '1001',
//     sId: '3001',
//     id: '3003',
//     title: '仿刺参',
//   },
//   {
//     saasId: '666666',
//     cId: '1001',
//     sId: '3001',
//     id: '3004',
//     title: '梅花参',
//   },
//   // 海参 》质量等级
//   {
//     saasId: '666666',
//     cId: '1001',
//     sId: null, // root spec
//     id: '4000',
//     title: '质量等级',
//   },
//   {
//     saasId: '666666',
//     cId: '1001',
//     sId: '4000',
//     id: '4001',
//     title: '特级',
//   },
//   {
//     saasId: '666666',
//     cId: '1001',
//     sId: '4000',
//     id: '4002',
//     title: '一级',
//   },
//   {
//     saasId: '666666',
//     cId: '1001',
//     sId: '4000',
//     id: '4003',
//     title: '二级',
//   },
//   {
//     saasId: '666666',
//     cId: '1001',
//     sId: '4000',
//     id: '4004',
//     title: '三级',
//   },
// ];

// const spec_haishen_fenlei = {
//   saasId: '666666',
//   cId: '1001',
//   id: '2000',
//   title: '分类',
//   specList: [
//     {
//       saasId: '666666',
//       cId: '1001',
//       sId: '2000',
//       id: '2001',
//       title: '干海参',
//     },
//     {
//       saasId: '666666',
//       cId: '1001',
//       sId: '2000',
//       id: '2002',
//       title: '生鲜海参',
//     },
//     {
//       saasId: '666666',
//       cId: '1001',
//       sId: '2000',
//       id: '2003',
//       title: '即食海参',
//     },
//   ],
// },
// const category_popup_specs=[
//   {
//     id: '2000',
//     title: '分类',
//     options: [
//       {
//         id: '2001',
//         title: '干海参',
//       },
//       {
//         id: '2002',
//         title: '生鲜海参',
//       },
//       {
//         id: '2003',
//         title: '即食海参',
//       },
//       {
//         id: '2004',
//         title: '即食海参',
//       },
//       {
//         id: '2005',
//         title: '即食海参',
//       },
//       {
//         id: '2006',
//         title: '即食海参',
//       },
//     ],
//   },
//   {
//     saasId: '666666',
//     cId: '1001',
//     sId: null, // root spec
//     id: '4000',
//     title: '质量等级',
//     options: [
//       {
//         saasId: '666666',
//         cId: '1001',
//         sId: '4000',
//         id: '4001',
//         title: '特级',
//       },
//       {
//         saasId: '666666',
//         cId: '1001',
//         sId: '4000',
//         id: '4002',
//         title: '一级',
//       },
//       {
//         saasId: '666666',
//         cId: '1001',
//         sId: '4000',
//         id: '4003',
//         title: '二级',
//       },
//       {
//         saasId: '666666',
//         cId: '1001',
//         sId: '4000',
//         id: '4004',
//         title: '三级',
//       },
//     ],
//   },
//   {
//     saasId: '666666',
//     cId: '1001',
//     sId: null, // root spec
//     id: '3000',
//     title: '科属',
//     options: [
//       {
//         saasId: '666666',
//         cId: '1001',
//         sId: '3000',
//         id: '3001',
//         title: '刺参科',
//         image: '',
//       },
//       {
//         saasId: '666666',
//         cId: '1001',
//         sId: '3000',
//         id: '3002',
//         title: '光参科',
//         image: '',
//       },
//     ],
//   },
// ];
